#Requires AutoHotkey v2.0
#SingleInstance Force
#HotString * ?

#HotIf GetKeyboardLayout() = -257948581
::,::්‍ර
#HotIf

::ග::.
::ල::,
::ඝ::ග
::.ග::ඟ
::.ළ::ළ
::ළ::ල
::.ද::ඳ

::ෙෙ::ෛ
::.ේ::ේ
::.ෝ::ෝ
::ෞ::ෞ

::අා::ආ
::අැ::ඇ
::ඔ්::ඕ

::පොස්::පොලිස් ස්ථානය
::ශල::ශ්‍රී ලංකා
::ශපො::ශ්‍රී ලංකා පොලිසිය
::කාකා::කාන්තා කාර්යාංශය
::පස3::පරීක්ෂණ සභාව
::පොඅකා::පොලිස් අධිකාරී කාර්යාලය
::මඅ::මහේස්ත්‍රාත් අධිකරණය
::අඅ::ආරක්ෂක අමාත්‍යංශය

::පාම::පාර්ලිමේන්තු මන්ත්‍රී
::කාපොසැ::කාන්තා පොලිස් සැරයන්
::පොසැ::පොලිස් සැරයන්
::නිපො::නියෝජ්‍ය පොලිස්පති
::පොකො::පොලිස් කොස්තාපල්
::උපොප::උප පොලිස් පරීක්ෂක
::පොප::පොලිස් පරීක්ෂක
::පපප::ප්‍රධාන පොලිස් පරීක්ෂක
::ස්ප::ස්ථානාධිපති
::සපොඅ::සහකාර පොලිස් අධිකාරී
::පැමෙනි::පැමිණිල්ල මෙහෙයවන නිලධාරී
::රැනි::රැකවරණ නිලධාරී
::චූනි::චූදිත නිලධාරී
::නිධ::නිලධාරියා
::මමි::මහත්මිය

::සෂ::සාක්ෂි
::සක3::සාක්ෂිකරු
::සසව::සාක්ෂි සම්පිණ්ඩන වාර්තාව
::සාස3::සාක්ෂි සම්පිණ්ඩන
::සඛ::සාක්ෂි ලේඛන
::සාමෙ::සාක්ෂි මෙහෙයවීම

::මූවි3::මූලික විමර්ශනය
::මූවිව3::මූලික විමර්ශන වාර්තාව
::මූවි8::මූලික විමර්ශන ගොනුව
::මූවිනි::මූලික විමර්ශන නිලධාරී

::පශි::පරිශිෂ්ටය
::සවා::සභා වාරය
::සැව::සැසිවාරය
::පුපි::පුද්ගලික ලිපිනය:
::අහැ::අපකීර්තිදායක හැසිරීම
::හප3::හරස් ප්‍රශ්න
::විවිප::විධිමත් විනය පරීක්ෂණය
::අසං::ආයතන සංග්‍රහය
::පිඅං::පිටු අංක
::චප::චෝදනා පත්‍රය
::දුක::දුරකථනය
::පිනු::ලිපි ගොනු
::සයම::ස්වභාවික යුක්තියේ මූලධර්ම

;* temp

^+F12:: MsgBox GetKeyboardLayout()

GetKeyboardLayout() {
    try {
        Focused := ControlGetClassNN(ControlGetFocus("A"))
    } catch {
        return ''
    }
    CtrlID := ControlGetHwnd(Focused, "A")
    ThreadID := DllCall("GetWindowThreadProcessId", "Ptr", CtrlID, "Ptr", 0)
    return DllCall("GetKeyboardLayout", "UInt", ThreadID, "Ptr")
}
